tap "alienator88/cask"
tap "buo/cask-upgrade"
tap "candid82/brew"
tap "charmbracelet/tap"
tap "federico-terzi/espanso"
tap "get-woke/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "martinfekete10/tap"
tap "mgmeyers/pdfannots2json"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shihanng/gig"
tap "yqrashawn/goku"
brew "act"
brew "xz"
brew "aspell"
brew "libgit2"
brew "bat"
brew "bat-extras"
brew "gettext"
brew "readline"
brew "glib"
brew "cliclick"
brew "cmake"
brew "cookiecutter"
brew "coreutils"
brew "deno"
brew "direnv"
brew "docker-compose"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "glances"
brew "libgpg-error"
brew "pkgconf"
brew "gobject-introspection"
brew "gotop"
brew "librsvg"
brew "graphviz"
brew "gum"
brew "highlight"
brew "imagemagick"
brew "jq"
brew "just"
brew "lazygit"
brew "ncdu"
brew "neovim"
brew "node"
brew "oath-toolkit"
brew "openjdk"
brew "pandoc"
brew "pandoc-crossref"
brew "php", restart_service: :changed
brew "pinentry-mac"
brew "poppler"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "scipy"
brew "sevenzip"
brew "silicon"
brew "smartmontools"
brew "speedtest-cli"
brew "tmux"
brew "tree"
brew "typst"
brew "vale"
brew "wget"
brew "xclip"
brew "yarn"
brew "yazi"
brew "youtube-dl"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "charmbracelet/tap/freeze"
brew "get-woke/tap/woke"
brew "jesseduffield/lazydocker/lazydocker"
brew "joshmedeski/sesh/sesh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mgmeyers/pdfannots2json/pdfannots2json"
brew "qmk/qmk/qmk"
brew "shihanng/gig/gig"
brew "yqrashawn/goku/goku"
cask "airbuddy"
cask "alfred"
cask "alt-tab"
cask "basictex"
cask "bettertouchtool"
cask "dbeaver-community"
cask "discord"
cask "espanso"
cask "eul"
cask "flux"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "github"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "iina"
cask "imagemin"
cask "iterm2"
cask "jordanbaird-ice"
cask "jupyter-notebook-viewer"
cask "keepingyouawake"
cask "keycastr"
cask "kitty"
cask "languagetool"
cask "localsend"
cask "mailtrackerblocker"
cask "mark-text"
cask "meetingbar"
cask "menubar-countdown"
cask "neovide"
cask "openinterminal-lite"
cask "pdf-expert"
cask "pearcleaner"
cask "piphero"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qmk-toolbox"
cask "rectangle"
cask "shottr"
cask "slack"
cask "steam"
cask "sublime-text"
cask "syntax-highlight"
cask "todoist"
cask "tuneful"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "zoom"
vscode "adpyke.codesnap"
vscode "albert.tabout"
vscode "asvetliakov.vscode-neovim"
vscode "bbenoist.shell"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chunsen.bracket-select"
vscode "codezombiech.gitignore"
vscode "deerawan.vscode-whitespacer"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "get-woke.vscode-woke"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "kevinrose.vsc-python-indent"
vscode "linusu.auto-dark-mode"
vscode "mechatroner.rainbow-csv"
vscode "michelemelluso.gitignore"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "nidu.copy-json-path"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "ryuta46.multi-command"
vscode "sandcastle.whitespace"
vscode "sumneko.lua"
vscode "tautvydasderzinskas.vscode-html-to-css"
vscode "timonwong.shellcheck"
vscode "tlahmann.alex-linter"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zeshuaro.vscode-python-poetry"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
