tap "alienator88/cask"
tap "azure/azd"
tap "azure/functions"
tap "buo/cask-upgrade"
tap "candid82/brew"
tap "charmbracelet/tap"
tap "federico-terzi/espanso"
tap "felixkratz/formulae"
tap "finnvoor/tools"
tap "get-woke/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "mgmeyers/pdfannots2json"
tap "morantron/tmux-fingers"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shihanng/gig"
tap "sst/tap"
tap "stackitcloud/tap"
tap "unhappychoice/tap"
tap "vladdoster/formulae"
tap "yqrashawn/goku"
brew "act"
brew "xz"
brew "aspell"
brew "readline"
brew "azure-cli"
brew "gettext"
brew "bash"
brew "libgit2"
brew "bat"
brew "bat-extras"
brew "bottom"
brew "btop"
brew "glib"
brew "carapace"
brew "cliclick"
brew "cmake"
brew "cookiecutter"
brew "coreutils"
brew "croc"
brew "curl"
brew "deno"
brew "direnv"
brew "docker-compose"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "glances"
brew "glow"
brew "libgpg-error"
brew "pkgconf"
brew "gobject-introspection"
brew "goku"
brew "gotop"
brew "librsvg"
brew "graphviz"
brew "gum"
brew "highlight"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "just"
brew "lazygit"
brew "macmon"
brew "mactop"
brew "ncdu"
brew "neovim"
brew "node"
brew "oath-toolkit"
brew "opencode"
brew "openjdk"
brew "pandoc"
brew "pandoc-crossref"
brew "php"
brew "pinentry-mac"
brew "poppler"
brew "postgresql@15"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "scipy"
brew "sevenzip"
brew "silicon"
brew "smartmontools"
brew "speedtest-cli"
brew "starship"
brew "stylua"
brew "tiger-vnc"
brew "tmux"
brew "tree"
brew "typst"
brew "vale"
brew "vivid"
brew "wget"
brew "whisper-cpp"
brew "xclip"
brew "xh"
brew "yarn"
brew "yazi"
brew "youtube-dl"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "azure/azd/azd"
brew "azure/functions/azure-functions-core-tools@4"
brew "charmbracelet/tap/crush"
brew "charmbracelet/tap/freeze"
brew "felixkratz/formulae/borders"
brew "get-woke/tap/woke"
brew "jesseduffield/lazydocker/lazydocker"
brew "joshmedeski/sesh/sesh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mgmeyers/pdfannots2json/pdfannots2json"
brew "morantron/tmux-fingers/tmux-fingers"
brew "qmk/qmk/qmk"
brew "shihanng/gig/gig"
brew "stackitcloud/tap/stackit"
brew "unhappychoice/tap/gitlogue"
cask "airbuddy"
cask "alfred"
cask "alt-tab"
cask "basictex"
cask "bettertouchtool"
cask "dbeaver-community"
cask "discord"
cask "espanso"
cask "eul"
cask "flux-app"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "hammerspoon"
cask "iina"
cask "imagemin"
cask "jordanbaird-ice"
cask "jupyter-notebook-viewer"
cask "keepingyouawake"
cask "keycastr"
cask "kitty"
cask "languagetool-desktop"
cask "leader-key"
cask "localsend"
cask "mailtrackerblocker"
cask "mark-text"
cask "meetingbar"
cask "menubar-countdown"
cask "openinterminal-lite"
cask "pdf-expert"
cask "pearcleaner"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qmk-toolbox"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "slack"
cask "steam"
cask "syntax-highlight"
cask "todoist-app"
cask "vimari"
cask "vnc-viewer"
cask "wkhtmltopdf"
cask "zoom"
