tap "asmvik/formulae"
tap "azure/azd"
tap "azure/functions"
tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "finnvoor/tools"
tap "get-woke/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jackielii/tap"
tap "jesseduffield/lazydocker"
tap "joshmedeski/sesh"
tap "mgmeyers/pdfannots2json"
tap "morantron/tmux-fingers"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shihanng/gig"
tap "sst/tap"
tap "tw93/tap"
tap "typewhisper/tap"
tap "unhappychoice/tap"
tap "vladdoster/formulae"
tap "yqrashawn/goku"
brew "act"
brew "asmvik/formulae/yabai"
brew "aspell"
brew "azure-cli"
brew "azure/azd/azd"
brew "azure/functions/azure-functions-core-tools@4"
brew "bash"
brew "bat"
brew "bat-extras"
brew "bottom"
brew "btop"
brew "cliclick"
brew "cmake"
brew "copier"
brew "coreutils"
brew "croc"
brew "curl"
brew "deno"
brew "direnv"
brew "docker-compose"
brew "eza"
brew "fastfetch"
brew "fd"
brew "felixkratz/formulae/borders"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "figlet"
brew "finnvoor/tools/yap"
brew "fzf"
brew "geckodriver"
brew "gemini-cli"
brew "get-woke/tap/woke"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "glib"
brew "glow"
brew "go"
brew "gobject-introspection"
brew "gotop"
brew "graphviz"
brew "gum"
brew "harfbuzz"
brew "harlequin"
brew "highlight"
brew "httpie"
brew "imagemagick"
brew "jackielii/tap/skhd-zig"
brew "jesseduffield/lazydocker/lazydocker"
brew "joshmedeski/sesh/sesh"
brew "jq"
brew "just"
brew "kew"
brew "lazygit"
brew "libgit2"
brew "libgpg-error"
brew "libpq"
brew "librsvg"
brew "luajit"
brew "macmon"
brew "mactop"
brew "mgmeyers/pdfannots2json/pdfannots2json"
brew "mise"
brew "morantron/tmux-fingers/tmux-fingers"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "oath-toolkit"
brew "openjdk"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "pandoc-crossref"
brew "pango"
brew "php"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "postgresql@15"
brew "prek"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-tk@3.10"
brew "python-tk@3.11"
brew "python@3.9"
brew "qmk/qmk/qmk"
brew "readline"
brew "ripgrep"
brew "rtk"
brew "ruff"
brew "rust"
brew "scipy"
brew "sevenzip"
brew "shihanng/gig/gig"
brew "silicon"
brew "slides"
brew "smartmontools"
brew "sox"
brew "speedtest-cli"
brew "anomalyco/tap/opencode"
brew "starship"
brew "stylua"
brew "television"
brew "terminal-notifier"
brew "tesseract"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tw93/tap/mole"
brew "typst"
brew "unhappychoice/tap/gitlogue"
brew "vale"
brew "vivid"
brew "watch"
brew "wget"
brew "whisper-cpp"
brew "whosthere"
brew "xclip"
brew "xh"
brew "xz"
brew "yarn"
brew "yazi"
brew "yq"
brew "yqrashawn/goku/goku"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
cask "airbuddy"
cask "alt-tab"
cask "basictex"
cask "dbeaver-community"
cask "dockdoor"
cask "dorso"
cask "espanso"
cask "eul"
cask "flux-app"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "hammerspoon"
cask "iina"
cask "imagemin"
cask "jupyter-notebook-viewer"
cask "keycastr"
cask "kitty"
cask "languagetool-desktop"
cask "leader-key"
cask "localsend"
cask "mailtrackerblocker"
cask "mark-text"
cask "meetingbar"
cask "ngrok"
cask "pdf-expert"
cask "pearcleaner"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "raycast"
cask "shottr"
cask "slack"
cask "syntax-highlight"
cask "thaw"
cask "todoist-app"
cask "typewhisper/tap/typewhisper"
cask "vladdoster/formulae/vimari"
cask "whichspace"
cask "wkhtmltopdf"
