tap "buo/cask-upgrade"
tap "candid82/brew"
tap "federico-terzi/espanso"
tap "get-woke/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "mgmeyers/pdfannots2json"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "yqrashawn/goku"
# General-purpose data compression with high compression ratio
brew "xz"
# Spell checker with better logic than ispell
brew "aspell"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Library for command-line editing
brew "readline"
# Core application library for C
brew "glib"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Cross-platform make
brew "cmake"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Common error values for all GnuPG components
brew "libgpg-error"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pandoc filter for numbering and cross-referencing
brew "pandoc-crossref"
# General-purpose scripting language
brew "php", restart_service: true
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Software for mathematics, science, and engineering
brew "scipy"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Syntax-aware linter for prose
brew "vale"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Detect non-inclusive language in your source code.
brew "get-woke/tap/woke"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Extract annotations from PDFs and convert them to JSON
brew "mgmeyers/pdfannots2json/pdfannots2json"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# karabiner configurator
brew "yqrashawn/goku/goku"
# AirPods companion app
cask "airbuddy"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Status monitoring
cask "eul"
# Screen colour temperature controller
cask "flux"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
# Desktop client for GitHub repositories
cask "github"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Free and open-source media player
cask "iina"
# Desktop image minifier
cask "imagemin"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Utility to render Jupyter notebooks
cask "jupyter-notebook-viewer"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Open-source keystroke visualiser
cask "keycastr"
# Grammar, spelling and style suggestions in all the writing apps
cask "languagetool"
# An open source cross-platform alternative to AirDrop
cask "localsend"
# Email tracker, read receipt and spy pixel blocker plugin for Apple Mail
cask "mailtrackerblocker"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Countdown timer for the menu bar
cask "menubar-countdown"
# PDF reader, editor and annotator
cask "pdf-expert"
# Menu bar app to picture-in-picture any window
cask "piphero"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Quicklook extension for source files
cask "syntax-highlight"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adpyke.codesnap"
vscode "albert.tabout"
vscode "bbenoist.shell"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "deerawan.vscode-whitespacer"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "get-woke.vscode-woke"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "gruntfuggly.todo-tree"
vscode "jgclark.vscode-todo-highlight"
vscode "kevinrose.vsc-python-indent"
vscode "linusu.auto-dark-mode"
vscode "mechatroner.rainbow-csv"
vscode "michelemelluso.gitignore"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nidu.copy-json-path"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "sandcastle.whitespace"
vscode "sandipchitale.vscode-indent-line"
vscode "tautvydasderzinskas.vscode-html-to-css"
vscode "tlahmann.alex-linter"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
