airbuddy
alfred
alt-tab
basictex
bettertouchtool
dbeaver-community
discord
eul
flux
font-im-writing-nerd-font
font-jetbrains-mono-nerd-font
font-monaspace
github
google-cloud-sdk
iina
imagemin
iterm2
jordanbaird-ice
jupyter-notebook-viewer
keepingyouawake
keycastr
languagetool
localsend
mailtrackerblocker
meetingbar
menubar-countdown
pdf-expert
piphero
qlcolorcode
qlmarkdown
qlstephen
qmk-toolbox
rectangle
shottr
slack
steam
sublime-text
syntax-highlight
todoist
visual-studio-code
wezterm
wkhtmltopdf
zoom
